; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	image4 - mode
	thermograph1 - mode
	spectrograph3 - mode
	image0 - mode
	image2 - mode
	Star2 - direction
	GroundStation9 - direction
	Star10 - direction
	GroundStation6 - direction
	GroundStation1 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	GroundStation0 - direction
	Star8 - direction
	GroundStation3 - direction
	Star7 - direction
	Planet11 - direction
	Planet12 - direction
	Planet13 - direction
	Star14 - direction
	Phenomenon15 - direction
	Planet16 - direction
)
(:init
	(supports instrument0 image2)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 GroundStation6)
	(supports instrument1 image2)
	(supports instrument1 thermograph1)
	(supports instrument1 image4)
	(calibration_target instrument1 GroundStation4)
	(calibration_target instrument1 GroundStation3)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 thermograph1)
	(supports instrument2 image4)
	(calibration_target instrument2 Star7)
	(calibration_target instrument2 GroundStation0)
	(calibration_target instrument2 Star8)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
	(supports instrument3 thermograph1)
	(supports instrument3 image0)
	(supports instrument3 spectrograph3)
	(calibration_target instrument3 GroundStation0)
	(calibration_target instrument3 GroundStation5)
	(supports instrument4 image4)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 Star8)
	(supports instrument5 image2)
	(supports instrument5 thermograph1)
	(calibration_target instrument5 Star7)
	(calibration_target instrument5 GroundStation3)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation0)
)
(:goal (and
	(have_image Planet11 image4)
	(have_image Planet12 image4)
	(have_image Planet13 image2)
	(have_image Star14 image0)
	(have_image Phenomenon15 image4)
	(have_image Planet16 image2)
))

)

; plan
1. (turn_to satellite0 groundstation1 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 groundstation1)
   goals met: 0 of 6
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 6
3. (calibrate satellite0 instrument1 groundstation1)
   added: (calibrated instrument1)
   goals met: 0 of 6
4. (turn_to satellite0 planet11 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 planet11)
   goals met: 0 of 6
5. (take_image satellite0 planet11 instrument1 image4)
   added: (have_image planet11 image4)
   goals met: 1 of 6
6. (turn_to satellite0 phenomenon15 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 phenomenon15)
   goals met: 1 of 6
7. (take_image satellite0 phenomenon15 instrument1 image4)
   added: (have_image phenomenon15 image4)
   goals met: 2 of 6
8. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 2 of 6
9. (calibrate satellite1 instrument3 groundstation0)
   added: (calibrated instrument3)
   goals met: 2 of 6
10. (turn_to satellite0 planet12 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 planet12)
   goals met: 2 of 6
11. (take_image satellite0 planet12 instrument1 image4)
   added: (have_image planet12 image4)
   goals met: 3 of 6
12. (turn_to satellite0 planet13 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet13)
   goals met: 3 of 6
13. (take_image satellite0 planet13 instrument1 image2)
   added: (have_image planet13 image2)
   goals met: 4 of 6
14. (turn_to satellite0 planet16 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 planet16)
   goals met: 4 of 6
15. (take_image satellite0 planet16 instrument1 image2)
   added: (have_image planet16 image2)
   goals met: 5 of 6
16. (turn_to satellite1 star14 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 star14)
   goals met: 5 of 6
17. (take_image satellite1 star14 instrument3 image0)
   added: (have_image star14 image0)
   goals met: 6 of 6
